Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxPfi_reg.h
/** \brief 20, ECC Status Register */
#define PFI2_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ECCS*)0xA8680020u)

/** \brief 2000, SBAB Record 0 */
#define PFI2_SBAB0_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8682000u)
/** Alias (User Manual Name) for PFI2_SBAB0_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB0_SBABRECORD.
*/
#define PFI2_SBABRECORD0 (PFI2_SBAB0_SBABRECORD)

/** \brief 2020, SBAB Record 1 */
#define PFI2_SBAB1_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8682020u)
/** Alias (User Manual Name) for PFI2_SBAB1_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB1_SBABRECORD.
*/
#define PFI2_SBABRECORD1 (PFI2_SBAB1_SBABRECORD)

/** \brief 2040, SBAB Record 2 */
#define PFI2_SBAB2_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8682040u)
/** Alias (User Manual Name) for PFI2_SBAB2_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB2_SBABRECORD.
*/
#define PFI2_SBABRECORD2 (PFI2_SBAB2_SBABRECORD)

/** \brief 2060, SBAB Record 3 */
#define PFI2_SBAB3_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8682060u)
/** Alias (User Manual Name) for PFI2_SBAB3_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB3_SBABRECORD.
*/
#define PFI2_SBABRECORD3 (PFI2_SBAB3_SBABRECORD)

/** \brief 2080, SBAB Record 4 */
#define PFI2_SBAB4_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8682080u)
/** Alias (User Manual Name) for PFI2_SBAB4_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB4_SBABRECORD.
*/
#define PFI2_SBABRECORD4 (PFI2_SBAB4_SBABRECORD)

/** \brief 20A0, SBAB Record 5 */
#define PFI2_SBAB5_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA86820A0u)
/** Alias (User Manual Name) for PFI2_SBAB5_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB5_SBABRECORD.
*/
#define PFI2_SBABRECORD5 (PFI2_SBAB5_SBABRECORD)

/** \brief 20C0, SBAB Record 6 */
#define PFI2_SBAB6_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA86820C0u)
/** Alias (User Manual Name) for PFI2_SBAB6_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB6_SBABRECORD.
*/
#define PFI2_SBABRECORD6 (PFI2_SBAB6_SBABRECORD)

/** \brief 20E0, SBAB Record 7 */
#define PFI2_SBAB7_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA86820E0u)
/** Alias (User Manual Name) for PFI2_SBAB7_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB7_SBABRECORD.
*/
#define PFI2_SBABRECORD7 (PFI2_SBAB7_SBABRECORD)

/** \brief 2100, SBAB Record 8 */
#define PFI2_SBAB8_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8682100u)
/** Alias (User Manual Name) for PFI2_SBAB8_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB8_SBABRECORD.
*/
#define PFI2_SBABRECORD8 (PFI2_SBAB8_SBABRECORD)

/** \brief 2120, SBAB Record 9 */
#define PFI2_SBAB9_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8682120u)
/** Alias (User Manual Name) for PFI2_SBAB9_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB9_SBABRECORD.
*/
#define PFI2_SBABRECORD9 (PFI2_SBAB9_SBABRECORD)

/** \brief 2140, SBAB Record 10 */
#define PFI2_SBAB10_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8682140u)
/** Alias (User Manual Name) for PFI2_SBAB10_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB10_SBABRECORD.
*/
#define PFI2_SBABRECORD10 (PFI2_SBAB10_SBABRECORD)

/** \brief 2160, SBAB Record 11 */
#define PFI2_SBAB11_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8682160u)
/** Alias (User Manual Name) for PFI2_SBAB11_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB11_SBABRECORD.
*/
#define PFI2_SBABRECORD11 (PFI2_SBAB11_SBABRECORD)

/** \brief 2180, SBAB Record 12 */
#define PFI2_SBAB12_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8682180u)
/** Alias (User Manual Name) for PFI2_SBAB12_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB12_SBABRECORD.
*/
#define PFI2_SBABRECORD12 (PFI2_SBAB12_SBABRECORD)

/** \brief 21A0, SBAB Record 13 */
#define PFI2_SBAB13_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA86821A0u)
/** Alias (User Manual Name) for PFI2_SBAB13_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB13_SBABRECORD.
*/
#define PFI2_SBABRECORD13 (PFI2_SBAB13_SBABRECORD)

/** \brief 21C0, SBAB Record 14 */
#define PFI2_SBAB14_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA86821C0u)
/** Alias (User Manual Name) for PFI2_SBAB14_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB14_SBABRECORD.
*/
#define PFI2_SBABRECORD14 (PFI2_SBAB14_SBABRECORD)

/** \brief 21E0, SBAB Record 15 */
#define PFI2_SBAB15_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA86821E0u)
/** Alias (User Manual Name) for PFI2_SBAB15_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB15_SBABRECORD.
*/
#define PFI2_SBABRECORD15 (PFI2_SBAB15_SBABRECORD)

/** \brief 2200, SBAB Record 16 */
#define PFI2_SBAB16_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8682200u)
/** Alias (User Manual Name) for PFI2_SBAB16_SBABRECORD.
* To use register names with standard convension, please use PFI2_SBAB16_SBABRECORD.
*/
#define PFI2_SBABRECORD16 (PFI2_SBAB16_SBABRECORD)

/** \brief 4000, DBAB Record 0 */
#define PFI2_DBAB0_DBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_DBAB_DBABRECORD*)0xA8684000u)
/** Alias (User Manual Name) for PFI2_DBAB0_DBABRECORD.
* To use register names with standard convension, please use PFI2_DBAB0_DBABRECORD.
*/
#define PFI2_DBABRECORD0 (PFI2_DBAB0_DBABRECORD)

/** \brief 4020, DBAB Record 1 */
#define PFI2_DBAB1_DBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_DBAB_DBABRECORD*)0xA8684020u)
/** Alias (User Manual Name) for PFI2_DBAB1_DBABRECORD.
* To use register names with standard convension, please use PFI2_DBAB1_DBABRECORD.
*/
#define PFI2_DBABRECORD1 (PFI2_DBAB1_DBABRECORD)

/** \brief 8000, MBAB Record 0 */
#define PFI2_MBAB0_MBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_MBAB_MBABRECORD*)0xA8688000u)
/** Alias (User Manual Name) for PFI2_MBAB0_MBABRECORD.
* To use register names with standard convension, please use PFI2_MBAB0_MBABRECORD.
*/
#define PFI2_MBABRECORD0 (PFI2_MBAB0_MBABRECORD)

