Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxPfi_reg.h
/** \brief C000, ZBAB Record 0 */
#define PFI2_ZBAB0_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA868C000u)
/** Alias (User Manual Name) for PFI2_ZBAB0_ZBABRECORD.
* To use register names with standard convension, please use PFI2_ZBAB0_ZBABRECORD.
*/
#define PFI2_ZBABRECORD0 (PFI2_ZBAB0_ZBABRECORD)

/** \brief C020, ZBAB Record 1 */
#define PFI2_ZBAB1_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA868C020u)
/** Alias (User Manual Name) for PFI2_ZBAB1_ZBABRECORD.
* To use register names with standard convension, please use PFI2_ZBAB1_ZBABRECORD.
*/
#define PFI2_ZBABRECORD1 (PFI2_ZBAB1_ZBABRECORD)

/** \brief C040, ZBAB Record 2 */
#define PFI2_ZBAB2_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA868C040u)
/** Alias (User Manual Name) for PFI2_ZBAB2_ZBABRECORD.
* To use register names with standard convension, please use PFI2_ZBAB2_ZBABRECORD.
*/
#define PFI2_ZBABRECORD2 (PFI2_ZBAB2_ZBABRECORD)

/** \brief C060, ZBAB Record 3 */
#define PFI2_ZBAB3_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA868C060u)
/** Alias (User Manual Name) for PFI2_ZBAB3_ZBABRECORD.
* To use register names with standard convension, please use PFI2_ZBAB3_ZBABRECORD.
*/
#define PFI2_ZBABRECORD3 (PFI2_ZBAB3_ZBABRECORD)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Pfi_Registers_Cfg_Pfi3
 * \{  */
/** \brief 0, ECC Read Register */
#define PFI3_ECCR /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ECCR*)0xA8980000u)

/** \brief 20, ECC Status Register */
#define PFI3_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ECCS*)0xA8980020u)

/** \brief 2000, SBAB Record 0 */
#define PFI3_SBAB0_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8982000u)
/** Alias (User Manual Name) for PFI3_SBAB0_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB0_SBABRECORD.
*/
#define PFI3_SBABRECORD0 (PFI3_SBAB0_SBABRECORD)

/** \brief 2020, SBAB Record 1 */
#define PFI3_SBAB1_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8982020u)
/** Alias (User Manual Name) for PFI3_SBAB1_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB1_SBABRECORD.
*/
#define PFI3_SBABRECORD1 (PFI3_SBAB1_SBABRECORD)

/** \brief 2040, SBAB Record 2 */
#define PFI3_SBAB2_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8982040u)
/** Alias (User Manual Name) for PFI3_SBAB2_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB2_SBABRECORD.
*/
#define PFI3_SBABRECORD2 (PFI3_SBAB2_SBABRECORD)

/** \brief 2060, SBAB Record 3 */
#define PFI3_SBAB3_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8982060u)
/** Alias (User Manual Name) for PFI3_SBAB3_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB3_SBABRECORD.
*/
#define PFI3_SBABRECORD3 (PFI3_SBAB3_SBABRECORD)

/** \brief 2080, SBAB Record 4 */
#define PFI3_SBAB4_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8982080u)
/** Alias (User Manual Name) for PFI3_SBAB4_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB4_SBABRECORD.
*/
#define PFI3_SBABRECORD4 (PFI3_SBAB4_SBABRECORD)

/** \brief 20A0, SBAB Record 5 */
#define PFI3_SBAB5_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA89820A0u)
/** Alias (User Manual Name) for PFI3_SBAB5_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB5_SBABRECORD.
*/
#define PFI3_SBABRECORD5 (PFI3_SBAB5_SBABRECORD)

/** \brief 20C0, SBAB Record 6 */
#define PFI3_SBAB6_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA89820C0u)
/** Alias (User Manual Name) for PFI3_SBAB6_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB6_SBABRECORD.
*/
#define PFI3_SBABRECORD6 (PFI3_SBAB6_SBABRECORD)

/** \brief 20E0, SBAB Record 7 */
#define PFI3_SBAB7_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA89820E0u)
/** Alias (User Manual Name) for PFI3_SBAB7_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB7_SBABRECORD.
*/
#define PFI3_SBABRECORD7 (PFI3_SBAB7_SBABRECORD)

/** \brief 2100, SBAB Record 8 */
#define PFI3_SBAB8_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8982100u)
/** Alias (User Manual Name) for PFI3_SBAB8_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB8_SBABRECORD.
*/
#define PFI3_SBABRECORD8 (PFI3_SBAB8_SBABRECORD)

/** \brief 2120, SBAB Record 9 */
#define PFI3_SBAB9_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8982120u)
/** Alias (User Manual Name) for PFI3_SBAB9_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB9_SBABRECORD.
*/
#define PFI3_SBABRECORD9 (PFI3_SBAB9_SBABRECORD)

/** \brief 2140, SBAB Record 10 */
#define PFI3_SBAB10_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8982140u)
/** Alias (User Manual Name) for PFI3_SBAB10_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB10_SBABRECORD.
*/
#define PFI3_SBABRECORD10 (PFI3_SBAB10_SBABRECORD)

/** \brief 2160, SBAB Record 11 */
#define PFI3_SBAB11_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8982160u)
/** Alias (User Manual Name) for PFI3_SBAB11_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB11_SBABRECORD.
*/
#define PFI3_SBABRECORD11 (PFI3_SBAB11_SBABRECORD)

/** \brief 2180, SBAB Record 12 */
#define PFI3_SBAB12_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8982180u)
/** Alias (User Manual Name) for PFI3_SBAB12_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB12_SBABRECORD.
*/
#define PFI3_SBABRECORD12 (PFI3_SBAB12_SBABRECORD)

/** \brief 21A0, SBAB Record 13 */
#define PFI3_SBAB13_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA89821A0u)
/** Alias (User Manual Name) for PFI3_SBAB13_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB13_SBABRECORD.
*/
#define PFI3_SBABRECORD13 (PFI3_SBAB13_SBABRECORD)

/** \brief 21C0, SBAB Record 14 */
#define PFI3_SBAB14_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA89821C0u)
/** Alias (User Manual Name) for PFI3_SBAB14_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB14_SBABRECORD.
*/
#define PFI3_SBABRECORD14 (PFI3_SBAB14_SBABRECORD)

/** \brief 21E0, SBAB Record 15 */
#define PFI3_SBAB15_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA89821E0u)
/** Alias (User Manual Name) for PFI3_SBAB15_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB15_SBABRECORD.
*/
#define PFI3_SBABRECORD15 (PFI3_SBAB15_SBABRECORD)

/** \brief 2200, SBAB Record 16 */
#define PFI3_SBAB16_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8982200u)
/** Alias (User Manual Name) for PFI3_SBAB16_SBABRECORD.
* To use register names with standard convension, please use PFI3_SBAB16_SBABRECORD.
*/
#define PFI3_SBABRECORD16 (PFI3_SBAB16_SBABRECORD)

