Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxPfi_reg.h
/** \brief 4000, DBAB Record 0 */
#define PFI3_DBAB0_DBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_DBAB_DBABRECORD*)0xA8984000u)
/** Alias (User Manual Name) for PFI3_DBAB0_DBABRECORD.
* To use register names with standard convension, please use PFI3_DBAB0_DBABRECORD.
*/
#define PFI3_DBABRECORD0 (PFI3_DBAB0_DBABRECORD)

/** \brief 4020, DBAB Record 1 */
#define PFI3_DBAB1_DBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_DBAB_DBABRECORD*)0xA8984020u)
/** Alias (User Manual Name) for PFI3_DBAB1_DBABRECORD.
* To use register names with standard convension, please use PFI3_DBAB1_DBABRECORD.
*/
#define PFI3_DBABRECORD1 (PFI3_DBAB1_DBABRECORD)

/** \brief 8000, MBAB Record 0 */
#define PFI3_MBAB0_MBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_MBAB_MBABRECORD*)0xA8988000u)
/** Alias (User Manual Name) for PFI3_MBAB0_MBABRECORD.
* To use register names with standard convension, please use PFI3_MBAB0_MBABRECORD.
*/
#define PFI3_MBABRECORD0 (PFI3_MBAB0_MBABRECORD)

/** \brief C000, ZBAB Record 0 */
#define PFI3_ZBAB0_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA898C000u)
/** Alias (User Manual Name) for PFI3_ZBAB0_ZBABRECORD.
* To use register names with standard convension, please use PFI3_ZBAB0_ZBABRECORD.
*/
#define PFI3_ZBABRECORD0 (PFI3_ZBAB0_ZBABRECORD)

/** \brief C020, ZBAB Record 1 */
#define PFI3_ZBAB1_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA898C020u)
/** Alias (User Manual Name) for PFI3_ZBAB1_ZBABRECORD.
* To use register names with standard convension, please use PFI3_ZBAB1_ZBABRECORD.
*/
#define PFI3_ZBABRECORD1 (PFI3_ZBAB1_ZBABRECORD)

/** \brief C040, ZBAB Record 2 */
#define PFI3_ZBAB2_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA898C040u)
/** Alias (User Manual Name) for PFI3_ZBAB2_ZBABRECORD.
* To use register names with standard convension, please use PFI3_ZBAB2_ZBABRECORD.
*/
#define PFI3_ZBABRECORD2 (PFI3_ZBAB2_ZBABRECORD)

/** \brief C060, ZBAB Record 3 */
#define PFI3_ZBAB3_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA898C060u)
/** Alias (User Manual Name) for PFI3_ZBAB3_ZBABRECORD.
* To use register names with standard convension, please use PFI3_ZBAB3_ZBABRECORD.
*/
#define PFI3_ZBABRECORD3 (PFI3_ZBAB3_ZBABRECORD)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXPFI_REG_H */
